/*
 * libs_serialid.c
 *
 *  Created on: 2011-2-16
 *      Author: Administrator
 */

#include "libs_emsys_odm.h"

#ifdef CFG_SERIALID_LIB

//*------------------------------------------------------------------------------------------------
//* 函数名称 : OpenSerialID
//* 功能描述 : 打开串行ID设备
//* 入口参数 : <dev>[in]  指定串行ID(DI)的设备文件名
//*                     : <mode>[in] 指定打开设备时的操作标识
//*                     :               读模式：O_RDONLY
//*                     :                               写模式：O_WRONLY
//*                     :               读写模式：O_RDWR
//* 返回值 : 成功返回设备文件句柄(>=0)；失败返回-1
//* 备  注 ：   无
//*------------------------------------------------------------------------------------------------
int
OpenSerialID(char *dev, int mode)
{
	int fd = -1;
	fd = open(dev, mode);
	if (fd < 0)
		return -1;

	return fd;
}

//*------------------------------------------------------------------------------------------------
//* 函数名称 : ReadSerialID
//* 功能描述 : 读取串行ID(DI)设备的唯一ID号
//* 入口参数 : <fd>[in]  <fd>[in]  指定DO设备的句柄(即OpenSerialID()的返回值)
//*                     : <data>[in/out]  返回ID数据
//*						: <len>[in/out]  返回ID数据的数据长度
//* 返回值 : 成功返回0；失败返回-1
//* 备  注 ：   无
//*------------------------------------------------------------------------------------------------
int ReadSerialID(int fd, unsigned char* data, unsigned char* len)
{
	int ret = 0;

	if(*len < 8)
		return -1;

	if(read(fd,data,8) < 0)
		ret = -1;
	else
		*len = 8;

	return ret;
}

//*------------------------------------------------------------------------------------------------
//* 函数名称 : CloseSerialID
//* 功能描述 : 关闭串行ID设备
//* 入口参数 : <fd>[in]  指定设备的句柄(即OpenSerialID()的返回值)
//* 返回值 : 成功返回0；失败返回-1
//* 备  注 ：   无
//*------------------------------------------------------------------------------------------------
int
CloseSerialID(int fd)
{
	if (close(fd) < 0)
		return -1;
	else
		return 0;
}

#endif
